In [3]:
import pandas as pd
import numpy as np

# Grouping data

In [3]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

## Which continent drinks more beer on average?

In [4]:
drinks.groupby(['continent'])['beer_servings'].mean().idxmax()

'EU'

## For each continent print the statistics for wine consumption

In [5]:
drinks.groupby(['continent'])['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [6]:
drinks.groupby(['continent'])['wine_servings'].agg(['mean', 'std', 'min', 'max'])

                 mean        std  min  max
continent
AF          16.264151  38.846419    0  233
AS           9.068182  21.667034    0  123
EU         142.222222  97.421738    0  370
OC          35.625000  64.555790    0  212
SA          62.416667  88.620189    1  221

## Print the mean alcohol consumption per continent for every column

In [9]:
drinks.groupby(['continent']).mean(numeric_only=True)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

## Print the median alcohol consumption per continent for every column

In [10]:
drinks.groupby(['continent']).median(numeric_only=True)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

## Print the mean, min and max values for spirit consumption

In [11]:
drinks.groupby(['continent']).agg('mean', 'min', 'max')

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

# Pivoting

In [4]:
df = pd.read_csv('../data/titanic.csv')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Unnamed: 15
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,NaN
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,NaN
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,NaN
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,NaN
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,NaN

## Find average survival rate by gender

In [ ]:
df.groupby('sex')['alive'].apply(lambda x : (x == 'yes').mean())

df_tmp = df.copy()
df_tmp['survived_numeric'] = df_tmp['alive'].map({'yes' : 1, 'no': 0})
df_tmp.groupby('sex')['survived_numeric'].mean()

sex
female    0.742038
male      0.188908
Name: survived_numeric, dtype: float64

## Create a Pivot table and find survival rate by gender on various classes

In [12]:
df_tmp = df.copy()
df_tmp['survived_numeric'] = df_tmp['alive'].map({'yes' : 1, 'no': 0})
pd.pivot_table(data=df_tmp, index='sex', columns='pclass', values='survived_numeric', aggfunc='mean')

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## Create a Pivot table and find survival rate by gender, age wise of various classes

In [13]:
pd.pivot_table(data=df_tmp, index=['sex', 'age'], columns='pclass', values='survived_numeric')

pclass          1    2     3
sex    age
female 0.75   NaN  NaN  1.00
       1.00   NaN  NaN  1.00
       2.00   0.0  1.0  0.25
       3.00   NaN  1.0  0.00
       4.00   NaN  1.0  1.00
...           ...  ...   ...
male   70.00  0.0  0.0   NaN
       70.50  NaN  NaN  0.00
       71.00  0.0  NaN   NaN
       74.00  NaN  NaN  0.00
       80.00  1.0  NaN   NaN

[145 rows x 3 columns]

## Partition each of the passengers into four categories based on their age (age categories (0, 10), (10, 30), (30, 60), (60, 80)) and then create a pivot table that counts survival by gender, categories wise age of various classes

In [ ]:
# pd.cut()
# pivot_table()

pclass              1     2      3
sex    age
female (0, 10]    1.0   8.0   22.0
       (10, 30]  34.0  36.0   57.0
       (30, 60]  48.0  30.0   22.0
       (60, 80]   2.0   NaN    1.0
male   (0, 10]    2.0   9.0   22.0
       (10, 30]  24.0  43.0  151.0
       (30, 60]  63.0  44.0   76.0
       (60, 80]  12.0   3.0    4.0

In [15]:
bins = [0, 10, 30, 60, 80]
df['age_bins'] = pd.cut(df['age'], bins)
df['survived_numeric'] = df['alive'].map({'yes': 1, 'no': 0})
df.pivot_table(index = ['sex', 'age_bins'], columns='pclass', values='survived_numeric', aggfunc='mean')

C:\Users\alesv\AppData\Local\Temp\ipykernel_22032\4212494393.py:4: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  df.pivot_table(index = ['sex', 'age_bins'], columns='pclass', values='survived_numeric', aggfunc='mean')

pclass                  1         2         3
sex    age_bins
female (0, 10]   0.000000  1.000000  0.500000
       (10, 30]  0.970588  0.916667  0.508772
       (30, 60]  0.979167  0.900000  0.272727
       (60, 80]  1.000000       NaN  1.000000
male   (0, 10]   1.000000  1.000000  0.363636
       (10, 30]  0.458333  0.023256  0.139073
       (30, 60]  0.412698  0.090909  0.118421
       (60, 80]  0.083333  0.333333  0.000000